{
  "architectures": [
    "ConvNextV2ForImageClassification"
  ],
  "depths": [
    3,
    3,
    27,
    3
  ],
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_sizes": [
    128,
    256,
    512,
    1024
  ],
  "id2label": {
    "0": "gun",
    "1": "knife"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "gun": 0,
    "knife": 1
  },
  "layer_norm_eps": 1e-12,
  "model_type": "convnextv2",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.57.0"
}
