{
  "architectures": [
    "ConvNextV2ForImageClassification"
  ],
  "depths": [
    3,
    3,
    27,
    3
  ],
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "baseball_bat",
    "1": "gun",
    "2": "knife",
    "3": "rifle"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "baseball_bat": 0,
    "gun": 1,
    "knife": 2,
    "rifle": 3
  },
  "layer_norm_eps": 1e-06,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnextv2",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.57.3"
}
